DataProcessors/Renault_РаботаСНовостямиДилеров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<DataProcessor>
		<Properties>
			<Name>Renault_РаботаСНовостямиДилеров</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АдресWS</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛогинWS</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПарольWS</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/CRM_НовостиДилеров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>CRM_НовостиДилеров</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаНачалаПоказа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОкончанияПоказа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДоступнаРОП</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДоступнаМенеджеру</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДоступнаРесепшн</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДоступнаСервису</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Renault_Версия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗаголовокНовости</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДоступнаВсемПользователям</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДоступнаМеханикам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДоступнаМенеджеруПоКорпоративнымПродажам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ТекстНовости</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ДилерскийЦентр</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ДилерскиеЦентры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторНовости</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

DataProcessors/Renault_РаботаСНовостямиДилеров/Ext/ObjectModule.bsl
Перем BIR;
Перем СервисФабрика;

// Точка входа
Процедура ОбработкаНаСервере() Экспорт
	
	Выборка = Справочники.CRM_ДилерскиеЦентры.Выбрать();
	Пока Выборка.Следующий() Цикл
		Если ЗначениеЗаполнено(Выборка.BIR) Тогда
			BIR = Выборка.BIR;
			ПолучитьДанныеИзЦентраль();
		КонецЕсли;
	КонецЦикла;
		
КонецПроцедуры

Процедура ПолучитьДанныеИзЦентраль() Экспорт
	
	ВебСервис = Renault_РаботаСНовостямиДилеров.ПолучитьПрокси();
	
	Если ВебСервис = Неопределено Тогда
		
		ЗаписьЖурналаРегистрации("Загрузка новостей. Не удалось подключиться к вебсервису.", УровеньЖурналаРегистрации.Ошибка);
		Возврат;
		
	КонецЕсли;
	
	Новости = ВебСервис.GetDealerNews(Дата(Формат(ТекущаяДата(), "ДФ=yyyyMMdd")));
	
	Сериал = новый СериализаторXDTO(ВебСервис.ФабрикаXDTO);
	Таблица = Сериал.ПрочитатьXDTO(Новости);
	
	Для Каждого Строка Из Таблица Цикл
		
		Если НовостьУжеЕсть(Новый УникальныйИдентификатор(Строка.Идентификатор)) = Истина Тогда
			
			Продолжить;
			
		КонецЕсли;
		
		Запись = РегистрыСведений.CRM_НовостиДилеров.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(Запись, Строка);
		Запись.ИдентификаторНовости = Новый УникальныйИдентификатор(Строка.Идентификатор);
		Запись.ДилерскийЦентр = Справочники.CRM_ДилерскиеЦентры.НайтиПоРеквизиту("BIR", BIR);
		Запись.Записать();
	КонецЦикла;

КонецПроцедуры

Функция НовостьУжеЕсть(Идентификатор)
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	CRM_НовостиДилеров.ИдентификаторНовости
	               |ИЗ
	               |	РегистрСведений.CRM_НовостиДилеров КАК CRM_НовостиДилеров
	               |ГДЕ
	               |	CRM_НовостиДилеров.ИдентификаторНовости = &ИдентификаторНовости";
				   
	Запрос.УстановитьПараметр("ИдентификаторНовости", Идентификатор);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		Возврат Истина;
		
	Иначе
		
		Возврат Ложь;
		
	КонецЕсли;	
	
КонецФункции;
 
АдресWS	 =Константы.Renault_АдресWebСервисов.Получить();
ЛогинWS	 = Константы.Renault_ЛогинВебСервиса.Получить();
ПарольWS = Константы.Renault_ПарольВебСервиса.Получить();
